In [1]:
import pandas as pd
import numpy as np
from env import get_db_url

In [2]:
url = get_db_url('employees')

In [3]:
pd.read_sql('SELECT * FROM employees LIMIT 5', url)

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

**5. Once you have successfully run a query:**

**a. Intentionally make a typo in the database url. What kind of error message do you see?**

In [4]:
bad_url = get_db_url('wrond_db')

In [5]:
#pd.read_sql('SELECT * FROM employees LIMIT 5', bad_url) 
#OperationalError: (pymysql.err.OperationalError) (1044, "Access denied for user...

**b. Intentionally make an error in your SQL query. What does the error message look like?**

In [6]:
#pd.read_sql('SELECT * FROM emploees LIMIT 5', url) 
#ProgrammingError: (pymysql.err.ProgrammingError) (1146, 
#"Table 'employees.emploees' doesn't exist")

**6. Read the employees and titles tables into two separate DataFrames.**

In [29]:
employees = pd.read_sql('SELECT * FROM employees', url)

In [8]:
employees.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [30]:
titles = pd.read_sql('SELECT * FROM titles', url)

In [31]:
titles.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

**7. How many rows and columns do you have in each DataFrame? Is that what you expected?**

In [11]:
employees.shape

(300024, 6)

In [12]:
titles.shape

(443308, 4)

**8. Display the summary statistics for each DataFrame.**

In [13]:
employees.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [14]:
titles.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

**9. How many unique titles are in the ```titles``` DataFrame?**

In [15]:
titles.title.nunique()

7

**10. What is the oldest date in the ```to_date``` column?**

In [16]:
titles.to_date.min()

datetime.date(1985, 3, 1)

**11. What is the most recent date in the to_date column?**

In [17]:
titles.to_date.max()

datetime.date(9999, 1, 1)

In [18]:
# a query to count the difference between today and to_date
# the query counts the absolute value, so the difference between future and past dates have the same difference

sql = '''
select  to_date, ABS(CURDATE() - to_date) as dif
 from titles
 order by to_date desc;
'''

In [19]:
# move the result of the query to the df
df = pd.read_sql(sql, url)

In [20]:
#past_date[past_date.dif == past_date.dif.min()].to_date.head(1)
recent_date = df[df.dif == df.dif.min()]
recent_date

           to_date     dif
240124  2002-08-01  200127
240125  2002-08-01  200127
240126  2002-08-01  200127
240127  2002-08-01  200127
240128  2002-08-01  200127
240129  2002-08-01  200127
240130  2002-08-01  200127
240131  2002-08-01  200127
240132  2002-08-01  200127
240133  2002-08-01  200127
240134  2002-08-01  200127
240135  2002-08-01  200127
240136  2002-08-01  200127
240137  2002-08-01  200127
240138  2002-08-01  200127
240139  2002-08-01  200127
240140  2002-08-01  200127
240141  2002-08-01  200127
240142  2002-08-01  200127
240143  2002-08-01  200127
240144  2002-08-01  200127
240145  2002-08-01  200127
240146  2002-08-01  200127
240147  2002-08-01  200127
240148  2002-08-01  200127
240149  2002-08-01  200127
240150  2002-08-01  200127
240151  2002-08-01  200127
240152  2002-08-01  200127
240153  2002-08-01  200127
240154  2002-08-01  200127
240155  2002-08-01  200127
240156  2002-08-01  200127
240157  2002-08-01  200127
240158  2002-08-01  200127
240159  2002-08-01  200127
240160  2002-08-01  200127
240161  2002-08-01  200127
240162  2002-08-01  200127
240163  2002-08-01  200127

In [21]:
recent_date.head(1).to_date

240124    2002-08-01
Name: to_date, dtype: object

### Exercises Part II

**1. Copy the ```users``` and ```roles``` DataFrames from the examples above.**

In [22]:
# Create the users DataFrame.

users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [23]:
# Create the roles DataFrame

roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

**2. What is the result of using a ```right``` join on the DataFrames?**

In [24]:
users.merge(roles, left_on='role_id', right_on='id', how='right')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0     1      admin
1   2.0    joe      2.0     2     author
2   3.0  sally      3.0     3   reviewer
3   4.0   adam      3.0     3   reviewer
4   NaN    NaN      NaN     4  commenter

In [39]:
#class solution
right_join = pd.merge(users, roles, left_on='role_id', right_on='id', how='right', indicator = True)
right_join

   id_x name_x  role_id  id_y     name_y      _merge
0   1.0    bob      1.0     1      admin        both
1   2.0    joe      2.0     2     author        both
2   3.0  sally      3.0     3   reviewer        both
3   4.0   adam      3.0     3   reviewer        both
4   NaN    NaN      NaN     4  commenter  right_only

In [41]:
#class solution
left_join = pd.merge(users, roles, left_on='role_id', right_on='id', how='left', indicator = True)
left_join

   id_x name_x  role_id  id_y    name_y     _merge
0     1    bob      1.0   1.0     admin       both
1     2    joe      2.0   2.0    author       both
2     3  sally      3.0   3.0  reviewer       both
3     4   adam      3.0   3.0  reviewer       both
4     5   jane      NaN   NaN       NaN  left_only
5     6   mike      NaN   NaN       NaN  left_only

**3. What is the result of using an ```outer``` join on the DataFrames?**

In [25]:
users.merge(roles, left_on='role_id', right_on='id', how='outer')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0   1.0      admin
1   2.0    joe      2.0   2.0     author
2   3.0  sally      3.0   3.0   reviewer
3   4.0   adam      3.0   3.0   reviewer
4   5.0   jane      NaN   NaN        NaN
5   6.0   mike      NaN   NaN        NaN
6   NaN    NaN      NaN   4.0  commenter

In [40]:
#class solution
outer_join = pd.merge(users, roles, left_on='role_id', right_on='id', how='outer', indicator = True)
outer_join

   id_x name_x  role_id  id_y     name_y      _merge
0   1.0    bob      1.0   1.0      admin        both
1   2.0    joe      2.0   2.0     author        both
2   3.0  sally      3.0   3.0   reviewer        both
3   4.0   adam      3.0   3.0   reviewer        both
4   5.0   jane      NaN   NaN        NaN   left_only
5   6.0   mike      NaN   NaN        NaN   left_only
6   NaN    NaN      NaN   4.0  commenter  right_only

**4. What happens if you drop the foreign keys from the DataFrames and try to merge them?**

In [26]:
users.drop(columns = 'role_id')

   id   name
0   1    bob
1   2    joe
2   3  sally
3   4   adam
4   5   jane
5   6   mike

In [27]:
#INCORRECT RESULT if join on id's without a foreign key
users.drop(columns = 'role_id').merge(roles, left_on='id', right_on='id', how='outer')

   id name_x     name_y
0   1    bob      admin
1   2    joe     author
2   3  sally   reviewer
3   4   adam  commenter
4   5   jane        NaN
5   6   mike        NaN

In [32]:
#Key Error
#users.drop(columns = 'role_id').merge(roles, left_on='role_id', right_on='id', how='outer')

In [42]:
#class solution
pd.merge(users, roles, how='outer', indicator = True)

   id       name  role_id      _merge
0   1        bob      1.0   left_only
1   2        joe      2.0   left_only
2   3      sally      3.0   left_only
3   4       adam      3.0   left_only
4   5       jane      NaN   left_only
5   6       mike      NaN   left_only
6   1      admin      NaN  right_only
7   2     author      NaN  right_only
8   3   reviewer      NaN  right_only
9   4  commenter      NaN  right_only

**5. Load the ```mpg``` dataset from PyDataset.**

In [67]:
from pydataset import data
mpg = data('mpg')
mpg.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl    class
1         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
2         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
3         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
4         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
5         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

**6. Output and read the documentation for the ```mpg``` dataset.**

In [34]:
data('mpg', show_doc=True)

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

**7. How many rows and columns are in the dataset?**

In [35]:
mpg.shape

(234, 11)

**8. Check out your column names and perform any cleanup you may want on them.**

In [36]:
list(mpg.columns)

['manufacturer',
 'model',
 'displ',
 'year',
 'cyl',
 'trans',
 'drv',
 'cty',
 'hwy',
 'fl',
 'class']

In [37]:
mpg.drop(columns = ['drv', 'fl']).head(2)

  manufacturer model  displ  year  cyl       trans  cty  hwy    class
1         audi    a4    1.8  1999    4    auto(l5)   18   29  compact
2         audi    a4    1.8  1999    4  manual(m5)   21   29  compact

In [45]:
#class solution -> rename columns with mg.columns = [___list of strings new_names ____]

**9. Display the summary statistics for the dataset.**

In [44]:
mpg.describe().round(2)

        displ     year     cyl     cty     hwy
count  234.00   234.00  234.00  234.00  234.00
mean     3.47  2003.50    5.89   16.86   23.44
std      1.29     4.51    1.61    4.26    5.95
min      1.60  1999.00    4.00    9.00   12.00
25%      2.40  1999.00    4.00   14.00   18.00
50%      3.30  2003.50    6.00   17.00   24.00
75%      4.60  2008.00    8.00   19.00   27.00
max      7.00  2008.00    8.00   35.00   44.00

**10. How many different manufacturers are there?**

In [43]:
mpg.manufacturer.nunique()

15

**11. How many different models are there?**

In [46]:
mpg.model.nunique()

38

**12. Create a column named ```mileage_difference``` like you did in the DataFrames exercises; this column should contain the difference between highway and city mileage for each car.**

In [68]:
mpg['mileage_difference'] = mpg.hwy - mpg.cty
mpg.head(2)

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8

**13. Create a column named ```average_mileage``` like you did in the DataFrames exercises; this is the mean of the city and highway mileage.**

In [ ]:
#mpg['average_mileage'] = round( (mpg.cty + mpg.hwy) / 2 , 2)
#mpg.head(2)

In [69]:
#correct solution is to use the harmonic mean

mpg['average_mileage'] = round(2 / ((1/mpg.hwy) + (1/mpg.cty)), 2)
mpg.head(2)

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference,average_mileage
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,22.21
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,24.36

**14. Create a new column on the ```mpg``` dataset named ```is_automatic``` that holds boolean values denoting whether the car has an automatic transmission.**

In [50]:
mpg.trans.unique()

array(['auto(l5)', 'manual(m5)', 'manual(m6)', 'auto(av)', 'auto(s6)',
       'auto(l4)', 'auto(l3)', 'auto(l6)', 'auto(s5)', 'auto(s4)'],
      dtype=object)

In [74]:
mpg['is_automatic'] = mpg.trans.str.contains('auto')
mpg.head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference,average_mileage,is_automatic
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,22.21,True
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,24.36,False
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,24.31,False
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,24.71,True
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,19.81,True

**15. Using the ```mpg``` dataset, find out which which manufacturer has the best miles per gallon on average?**

In [70]:
mpg.groupby('manufacturer').average_mileage.mean().round(1).sort_values(ascending = False).head(1)

manufacturer
honda    27.9
Name: average_mileage, dtype: float64

In [71]:
#class solution
mpg.groupby('manufacturer').average_mileage.mean().nlargest(1)

manufacturer
honda    27.891111
Name: average_mileage, dtype: float64

**16. Do automatic or manual cars have better miles per gallon?**

In [76]:
mpg.groupby('is_automatic').average_mileage.mean().round(1)

is_automatic
False    21.6
True     18.6
Name: average_mileage, dtype: float64

In [77]:
#class solution
mpg['transmission category'] = np.where(mpg.trans.str.contains('auto'), 'automatic', 'manual')

In [78]:
mpg.head(2)

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference,average_mileage,is_automatic,transmission category
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,22.21,True,automatic
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,24.36,False,manual

In [79]:
mpg.groupby('transmission category')[['average_mileage']].mean().round(1)

                       average_mileage
transmission category
automatic                         18.6
manual                            21.6

### Exercises  Part III

**1. Use your get_db_url function to help you explore the data from the chipotle database.**

In [81]:
url_c = get_db_url('chipotle')

In [82]:
chipotle = pd.read_sql('SELECT * FROM orders', url_c)

In [83]:
chipotle.head()

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",$16.98

**2. What is the total price for each order?**

In [91]:
chipotle['item_price_number'] = chipotle.item_price.str.strip('$').str.replace(',', '').astype(float)

In [92]:
chipotle.head()

,id,order_id,quantity,item_name,choice_description,item_price,item_price_number
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39,2.39
1,2,1,1,Izze,[Clementine],$3.39,3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39,3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39,2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",$16.98,16.98

In [94]:
chipotle.pivot_table(index = 'order_id', values = 'item_price_number', aggfunc='sum')

          item_price_number
order_id
1                     11.56
2                     16.98
3                     12.67
4                     21.00
5                     13.70
...                     ...
1830                  23.00
1831                  12.90
1832                  13.20
1833                  23.50
1834                  28.75

[1834 rows x 1 columns]

**3. What are the most popular 3 items?**

In [96]:
chipotle.groupby('item_name').quantity.sum().nlargest(3)

item_name
Chicken Bowl           761
Chicken Burrito        591
Chips and Guacamole    506
Name: quantity, dtype: int64

In [97]:
query_popular_item = 'SELECT item_name, SUM(quantity) as q \
            FROM orders \
            GROUP BY item_name \
            ORDER BY q DESC \
            LIMIT 3'

In [98]:
pd.read_sql(query_popular_item, url_c)

             item_name      q
0         Chicken Bowl  761.0
1      Chicken Burrito  591.0
2  Chips and Guacamole  506.0

**4. Which item has produced the most revenue?**

In [102]:
chipotle['total_price'] = chipotle.quantity * chipotle.item_price_number

In [146]:
chipotle.groupby('item_name').total_price.sum().nlargest(1)

item_name
Chicken Bowl    8044.63
Name: total_price, dtype: float64

In [147]:
#class solution
chipotle.groupby('item_name').item_price_number.sum().nlargest(1)

item_name
Chicken Bowl    7342.73
Name: item_price_number, dtype: float64

**5. Join the employees and titles DataFrames together.**

In [111]:
employees.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [112]:
titles.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [115]:
emp_titles = pd.merge(employees, titles, left_on = 'emp_no', right_on = 'emp_no', how = 'outer')

In [138]:
len(emp_titles)

443308

**6. For each title, find the hire date of the employee that was hired most recently with that title.**

In [137]:
titles_dates = emp_titles.groupby('title').hire_date.max()
titles_dates

title
Assistant Engineer    1999-12-24
Engineer              2000-01-28
Manager               1992-02-05
Senior Engineer       2000-01-01
Senior Staff          2000-01-13
Staff                 2000-01-12
Technique Leader      1999-12-31
Name: hire_date, dtype: object

In [157]:
#same exercise but with more info

In [153]:
sql_dates = '''
SELECT gr.title, e.emp_no, CONCAT(e.first_name, ' ', e.last_name) as full_name, d.dept_name, gr.hire_date
FROM employees e
JOIN titles t USING(emp_no)
JOIN
(SELECT  t.title, MAX(e.hire_date) as hire_date
FROM titles t
JOIN employees e USING(emp_no)
GROUP BY t.title
ORDER BY t.title) AS gr ON t.title = gr.title AND e.hire_date = gr.hire_date
LEFT JOIN dept_emp de USING (emp_no)
JOIN departments d USING(dept_no)
ORDER BY gr.title
'''

In [154]:
titles_dates_table = pd.read_sql(sql_dates, url)

In [156]:
titles_dates_table

,title,emp_no,full_name,dept_name,hire_date
0,Assistant Engineer,243702,Munehiro Luke,Production,1999-12-24
1,Engineer,463807,Bikash Covnot,Quality Management,2000-01-28
2,Manager,110420,Oscar Ghazalie,Production,1992-02-05
3,Senior Engineer,108201,Mariangiola Boreale,Production,2000-01-01
4,Senior Staff,222965,Volkmar Perko,Human Resources,2000-01-13
5,Staff,47291,Ulf Flexer,Human Resources,2000-01-12
6,Technique Leader,294732,Karlis Orsini,Development,1999-12-31

**7. Write the code necessary to create a cross tabulation of the number of titles by department. (Hint: this will involve a combination of SQL code to pull the necessary data and python/pandas code to perform the manipulations.)**

In [129]:
titles_per_dept_query = 'SELECT d.dept_name, t.title \
                FROM departments d \
                JOIN dept_emp de USING(dept_no) \
                JOIN titles t USING(emp_no)'

In [134]:
titles_per_department = pd.read_sql(titles_per_dept_query, url)

In [135]:
titles_per_department.head()

          dept_name         title
0  Customer Service         Staff
1  Customer Service  Senior Staff
2  Customer Service         Staff
3  Customer Service  Senior Staff
4  Customer Service         Staff

In [136]:
pd.crosstab(titles_per_department.dept_name, titles_per_department.title)

title,Assistant Engineer,Engineer,Manager,Senior Engineer,Senior Staff,Staff,Technique Leader
dept_name,,,,,,,
Customer Service,298,2362,4,2027,13925,16150,309
Development,7769,58135,2,49326,1247,1424,7683
Finance,0,0,2,0,12139,13929,0
Human Resources,0,0,2,0,12274,14342,0
Marketing,0,0,2,0,13940,16196,0
Production,6445,49649,4,42205,1270,1478,6557
Quality Management,1831,13852,4,11864,0,0,1795
Research,378,2986,2,2570,11637,13495,393
Sales,0,0,2,0,36191,41808,0

*Class solution. Same result*

In [149]:
quer = '''
SELECT t.emp_no, t.title, t.to_date, d.dept_name
FROM departments d
JOIN dept_emp de USING(dept_no)
JOIN titles t USING(emp_no)
'''

In [150]:
all_titles_dept = pd.read_sql(quer, url)

In [151]:
all_titles_dept.head()

   emp_no         title     to_date         dept_name
0   10011         Staff  1996-11-09  Customer Service
1   10038  Senior Staff  9999-01-01  Customer Service
2   10038         Staff  1996-09-20  Customer Service
3   10049  Senior Staff  9999-01-01  Customer Service
4   10049         Staff  2000-05-04  Customer Service

In [152]:
pd.crosstab(all_titles_dept.dept_name, all_titles_dept.title)

title,Assistant Engineer,Engineer,Manager,Senior Engineer,Senior Staff,Staff,Technique Leader
dept_name,,,,,,,
Customer Service,298,2362,4,2027,13925,16150,309
Development,7769,58135,2,49326,1247,1424,7683
Finance,0,0,2,0,12139,13929,0
Human Resources,0,0,2,0,12274,14342,0
Marketing,0,0,2,0,13940,16196,0
Production,6445,49649,4,42205,1270,1478,6557
Quality Management,1831,13852,4,11864,0,0,1795
Research,378,2986,2,2570,11637,13495,393
Sales,0,0,2,0,36191,41808,0